backend/app/controllers/cities_controller.rb

    def index
        cities = City.all
---
SELECT "cities".* FROM "cities"

    def create
        if city = City.find_by(name: params[:name])
            render json: CitySerializer.new(city)
        else
            city = City.new(city_params)
            if city.save
---
SELECT "cities".* FROM "cities" WHERE "cities"."name" = ? LIMIT ?  [["name", "yo"], ["LIMIT", 1]]
INSERT INTO "cities" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", ""], ["created_at", "2021-04-06 01:13:20.902468"], ["updated_at", "2021-04-06 01:13:20.902468"]]

    def background
        city = City.find_by(id: params[:id])
        city.image.attach(params[:image])
        if city.save
---
SELECT "cities".* FROM "cities" WHERE "cities"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "cities" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "New York"], ["created_at", "2021-08-24 03:58:39.048318"], ["updated_at", "2021-08-24 03:58:39.048318"]]
UPDATE "cities" SET "updated_at" = ? WHERE "cities"."id" = ?  [["updated_at", "2022-11-15 14:57:41.436354"], ["id", 1]]