backend/app/controllers/restaurants_controller.rb

SELECT "cities".* FROM "cities" WHERE "cities"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "restaurants".* FROM "restaurants"
---
    def index
        if !!params[:city_id]
            city = City.find_by(id: params[:city_id])
            restaurants = city.restaurants
        else
            restaurants = Restaurant.all

SELECT "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
---
    def show
        restaurant = Restaurant.find_by(id: params[:id])

INSERT INTO "restaurants" ("name", "style", "neighborhood", "notes", "top_dishes", "created_at", "updated_at", "city_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
    def create
        restaurant = Restaurant.new(restaurant_params)
        if restaurant.save

SELECT "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
UPDATE "restaurants" SET "style" = ?, "neighborhood" = ?, "top_dishes" = ?, "updated_at" = ? WHERE "restaurants"."id" = ?  [["style", "Italianyyyyy"], ["neighborhood", "Little Italyyyyyy"], ["top_dishes", "---\n- Spedini ala Romana, Mario’s epic seafood salad\n"], ["updated_at", "2021-04-07 03:32:36.529695"], ["id", 1]]
---
    def update
        restaurant = Restaurant.find_by(id: params[:id])
        if restaurant.update(restaurant_params)

SELECT "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = ? LIMIT ?  [["id", 19], ["LIMIT", 1]]
DELETE FROM "restaurants" WHERE "restaurants"."id" = ?  [["id", 19]]
---
    def destroy
        restaurant = Restaurant.find_by(id: params[:id])
        if restaurant.destroy