backend/app/controllers/restaurants_controller.rb

    def index
        if !!params[:city_id]
            restaurants = Restaurant.where(city_id: params[:city_id])
---
SELECT "restaurants"."id" FROM "restaurants" WHERE "restaurants"."city_id" = ?  [["city_id", 1]]